Repository: MIPS/binutils-gdb
Catalog: gprof/po/*.po
Languages: tr

source: <indirect child>
tr: <dolaylý ast>

source: [find_call] %s: 0x%lx to 0x%lx
tr: [find_call] %s: 0x%lx'dan 0x%lx'a

source: [find_call] 0x%lx: jsr%s <indirect_child>
tr: [find_call] 0x%lx: jsr%s <dolaylý_ast>

source: %s: %s: unexpected end of file
tr: %s: %s: beklenmeyen dosyasonu

source: %s: warning: ignoring basic-block exec counts (use -l or --line)
tr: %s: uyarý: temel blok yürütme sayýlarý yoksayýldý (-l veya --line kullanýn)

source: %s:%d: (%s:0x%lx) %lu executions
tr: %s:%d: (%s:0x%lx) %lu yürütme

source: <unknown>
tr: <bilinmeyen>

source: Top %d Lines: Line Count
tr: Tepe %d Satýr: Satýr Sayý

source: Execution Summary:
tr: Yürütme Özeti:

source: %9ld Executable lines in this file
tr: %9ld yürütülür satýr -- bu dosyada

source: %9ld Lines executed
tr: %9ld Yürütülen Satýr

source: %9.2f Percent of the file executed
tr: %9.2f Dosyanýn yürütülen kýsým yüzdesi

source: %9lu Total number of line executions
tr: %9lu Toplam satýr yürütüþ sayýsý

source: %9.2f Average executions per line
tr: %9.2f Satýr baþýna ortalama yürütüþ sayýsý

source: [cg_tally] arc from %s to %s traversed %lu times
tr: [cg_tally] %s'dan %s'a olan yay %lu defa geçildi

source: Call graph (explanation follows)
tr: Çaðrý grafiði (açýklama aþaðýda)

source: Call graph
tr: Çaðrý grafiði

source: granularity: each sample hit covers %ld byte(s)
tr: Öðe boyu: her örnek %ld bayt içermektedir

source: for %.2f%% of %.2f seconds
tr: Toplam %2$.2f saniyenin %1$.2f%%'si için

source: no time propagated
tr: zaman ilerletilmedi

source: called
tr: çaðrýldý

source: total
tr: toplam

source: parents
tr: üstler

source: index
tr: indeks

source: %time
tr: zaman%

source: self
tr: kendisi

source: descendents
tr: astlar

source: name
tr: isim

source: children
tr: astlar

source: index %% time self children called name
tr: indeks %% zaman kendi astlar çaðrýldý isim

source: <cycle %d as a whole> [%d]
tr: <%d'yi bütün olarak çevrimler> [%d]

source: %6.6s %5.5s %7.7s %11.11s %7.7s %7.7s <spontaneous>
tr: %6.6s %5.5s %7.7s %11.11s %7.7s %7.7s <kendiliðinden>

source: %6.6s %5.5s %7.7s %7.7s %7.7s %7.7s <spontaneous>
tr: %6.6s %5.5s %7.7s %7.7s %7.7s %7.7s <kendiliðinden>

source: Index by function name
tr: Ýþlev adýna göre indeks

source: <cycle %d>
tr: <çevrim %d>

source: %s: could not open %s.
tr: %s: %s açýlamadý.

source: %s: unable to parse mapping file %s.
tr: %s: eþlem dosyasý %s ayrýþtýrýlamadý.

source: %s: %s: not in a.out format
tr: %s: %s: a.out biçeminde deðil

source: %s: can't find .text section in %s
tr: %s: %s içerisinde .text (metin) bölümü bulunamadý

source: %s: ran out room for %lu bytes of text space
tr: %s: %lu bayt metin yeri için yer bulunamadý

source: %s: can't do -c
tr: %s: -c yapýlamýyor

source: %s: -c not supported on architecture %s
tr: %s: -c %s platformu üzerinde desteklenmiyor

source: %s: file `%s' has no symbols
tr: %s: `%s' dosyasý sembol içermiyor

source: %s: somebody miscounted: ltab.len=%d instead of %ld
tr: %1$s: hatalý sayým: %3$ld yerine ltab.len=%2$d

source: %s: bfd_vma has unexpected size of %ld bytes
tr: %s: beklenmeyen boyut: bfd_vma'nýn boyutu %ld bayt

source: %s: file too short to be a gmon file
tr: %s: Dosya bir gmon dosyasý olmak için çok kýsa

source: %s: file `%s' has bad magic cookie
tr: %s: `%s' dosyasýnda kötü sihirli çerez var

source: %s: file `%s' has unsupported version %d
tr: %s: `%s' dosyasý desteklenmeyen %d sürümünde

source: %s: %s: found bad tag %d (file corrupted?)
tr: %s: %s: Hatalý etiket %d bulundu (dosya bozuk mu?)

source: %s: profiling rate incompatible with first gmon file
tr: %s: profilleme hýzý ilk gmon dosyasý ile uyumlu deðil

source: %s: incompatible with first gmon file
tr: %s: ilk gmon dosyasý ile uyumlu deðil

source: %s: file '%s' does not appear to be in gmon.out format
tr: %s: '%s' dosyasý gmon.out biçeminde deðil

source: %s: unexpected EOF after reading %d/%d bins
tr: %s: %d/%d sele okunduktan sonra beklenmeyen dosyasonu (EOF) bulundu

source: time is in ticks, not seconds
tr: zaman týk olarak veriliyor, saniye olarak deðil

source: %s: don't know how to deal with file format %d
tr: %s: %d dosya biçeminin nasýl iþleneceði bilinmiyor

source: File `%s' (version %d) contains:
tr: `%s' Dosyasý (%d sürümü) aþaðýdakileri içeriyor:

source: %d histogram record%s
tr: %d geçmiþ grafiði kaydý%s

source: %d call-graph record%s
tr: %d çaðrý grafiði kaydý%s

source: %d basic-block count record%s
tr: %d temel blok sayým kaydý%s

source: Usage: %s [-[abcDhilLsTvwxyz]] [-[ACeEfFJnNOpPqQZ][name]] [-I dirs] [-d[num]] [-k from/to] [-m min-count] [-t table-length] [--[no-]annotated-source[=name]] [--[no-]exec-counts[=name]] [--[no-]flat-profile[=name]] [--[no-]graph[=name]] [--[no-]time=name] [--all-lines] [--brief] [--debug[=level]] [--function-ordering] [--file-ordering] [--directory-path=dirs] [--display-unused-functions] [--file-format=name] [--file-info] [--help] [--line] [--min-count=n] [--no-static] [--print-path] [--separate-files] [--static-call-graph] [--sum] [--table-length=len] [--traditional] [--version] [--width=n] [--ignore-non-functions] [--demangle[=STYLE]] [--no-demangle] [image-file] [profile-file...]
tr: Kullaným: %s [-[abcDhilLsTvwxyz]] [-[ACeEfFJnNOpPqQZ][isim]] [-I dizinler] [-d[sayý]] [-k hedeften/hedefe] [-m minimum-sayý] [-t tablo-uzunluðu] [--[no-]annotated-source[=isim]] açýklamalý kaynak kodunu gösterir/göstermez [--[no-]exec-counts[=isim]] yürütme sayýsýný gösterir/göstermez [--[no-]flat-profile[=isim]] düz profil çýktýlar [--[no-]graph[=isim]] grafik çýktýlar [--[no-]time=isim] zaman bilgisi çýktýlar [--all-lines] bütün satýrlarý gösterir [--brief] kýsa çýktý verir [--debug[=seviye]] hata ayýklama seviyesini atar [--function-ordering] iþlev adýna göre sýralar [--file-ordering] dosya adýna göre sýralar [--directory-path=dizinler] dizin adres yolunu belirtir [--display-unused-functions] kullanýlmayan iþlevleri gösterir [--file-format=isim] dosya biçemini belirtir [--file-info] dosya bilgisini gösterir [--help] yardým bilgisi gösterir [--line] satýr bilgisi gösterir [--min-count=n] minimum sayýyý atar [--no-static] statik iþlemleri yoksayar [--print-path] yazdýrma yolu [--separate-files] ayrý dosyalar [--static-call-graph] statik çaðrý grafiði [--sum] toplam [--table-length=uzunluk] tablo uzunluðu [--traditional] geleneksel [--version] sürüm bilgisi gösterir [--width=n] geniþlik [--ignore-non-functions] iþlev olmayanlarý yoksayar [--demangle[=TARZ]] düzeltme tarzý atar [--no-demangle] düzeltme uygulamaz [görüntü-dosyasý] [profil-dosyasý...]

source: Report bugs to %s
tr: Yazýlým hatalarýný %s adresine, çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine gönderin

source: %s: debugging not supported; -d ignored
tr: %s: hata ayýklama desteklenmiyor; -d yoksayýldý

source: %s: unknown file format %s
tr: %s: bilinmeyen dosya biçemi %s

source: Based on BSD gprof, copyright 1983 Regents of the University of California.
tr: BSD gprof baz alýnmýþtýr. BSD gprof Telif Hakký 1983 Regents of the University of California.

source: This program is free software. This program has absolutely no warranty.
tr: Bu yazýlým bir serbest yazýlýmdýr. Bu yazýlýmýn herhangi bir garantisi yoktur.

source: %s: unknown demangling style `%s'
tr: %s: bilinmeyen düzeltme tarzý `%s'

source: %s: Only one of --function-ordering and --file-ordering may be specified.
tr: %s: --function-ordering (iþleve göre sýrala) ve --file-ordering (dosyaya göre sýrala) seçeneklerinin biri seçilebilir.

source: %s: sorry, file format `prof' is not yet supported
tr: %s: `prof' dosya biçemi henüz desteklenmiyor

source: %s: gmon.out file is missing histogram
tr: %s: gmon.out dosyasýnda geçmiþ grafiði yok

source: %s: gmon.out file is missing call-graph data
tr: %s: gmon.out dosyasýnda çaðrý grafik verisi yok

source: %s: `%s' is incompatible with first gmon file
tr: %s: `%s' ilk gmon dosyasý ile uyumlu deðil

source: %s: %s: unexpected EOF after reading %d of %d samples
tr: %1$s: %2$s: Toplam %4$d örneðin %3$d'si okunduktan sonra beklenmeyen dosyasonu(EOF) bulundu

source: %c%c/call
tr: %c%c/çaðrý

source: for %.2f%% of %.2f %s
tr: Toplam %2$.2f %3$s'nin %1$.2f%%'si okundu

source: Each sample counts as %g %s.
tr: Her örnek %g %s sayýlýyor.

source: no time accumulated
tr: zamanlama deðeri biriktirilemedi

source: cumulative
tr: birikmiþ

source: self
tr: kendisi

source: total
tr: toplam

source: time
tr: zaman

source: calls
tr: çaðrý

source: flat profile:
tr: düz profil:

source: Flat profile:
tr: Düz profil:

source: %s: could not locate `%s'
tr: %s: `%s' bulunamadý

source: *** File %s:
tr: *** %s Dosyasý:

source: <cycle %d>
tr: <çevrim %d>
