Repository: MIPS/binutils-gdb
Catalog: ld/po/*.po
Languages: tr

source: Default search path for Solaris compatibility
tr: Solaris uyumluluðu için öntanýmlý arama yolu

source: Start a group
tr: Grup baþlatýr

source: End a group
tr: Grup sonlandýrýr

source: Ignored for SunOS compatibility
tr: SunOS uyumluluðu için yoksayýldý

source: Link against shared libraries
tr: Paylaþýmlý kitaplýklara baðlanýr

source: Do not link against shared libraries
tr: Paylaþýmlý kitaplýklara baðlanmaz

source: Bind global references locally
tr: Evrensel baþvurularý yerel baðlar

source: Check section addresses for overlaps (default)
tr: (öntanýmlý) Bölüm adreslerini örtüþme için kontrol eder

source: Do not check section addresses for overlaps
tr: Bölüm adreslerini örtüþme için kontrol etmez

source: Output cross reference table
tr: Çapraz baþvuru tablosunu çýktýlar

source: SYMBOL=EXPRESSION
tr: SEMBOL=ÝFADE

source: Define a symbol
tr: Sembol tanýmlar

source: [=STYLE]
tr: [=TARZ]

source: Demangle symbol names [using STYLE]
tr: [TARZ kullanarak] sembol isimlerini düzeltir

source: PROGRAM
tr: YAZILIM

source: Set the dynamic linker to use
tr: Dinamik baðlayýcýyý YAZILIM'ý kullanmaya atar

source: Generate embedded relocs
tr: Gömülü yerdeðiþimler oluþturur

source: Call SYMBOL at unload-time
tr: Boþaltma zamanýnda SEMBOL'ü çaðýrýr

source: Force generation of file with .exe suffix
tr: Dosyanýn .exe soneki ile oluþturulmasýný saðlar

source: Remove unused sections (on some targets)
tr: (Bazý hedeflerde) kullanýlmayan bölümleri siler

source: Don't remove unused sections (default)
tr: (öntanýmlý) Kullanýlmayan bölümleri silmez

source: Print option help
tr: Seçenek yardýmýný gösterir

source: Call SYMBOL at load-time
tr: Yükleme sýrasýnda SEMBOL'ü çaðýrýr

source: Write a map file
tr: Eþleme dosyasý yazdýrýr

source: Do not demangle symbol names
tr: Sembol isimlerini düzeltmez

source: Use less memory and more disk I/O
tr: Daha az bellek ve daha fazla disk I/O kullanýr

source: Allow no undefined symbols
tr: Tanýmsýz sembollere izin vermez

source: Allow undefined symbols in shared objects
tr: Paylaþýmlý nesnelerde tanýmsýz sembollere izin verir

source: Don't warn about mismatched input files
tr: Eþleþmeyen girdi dosyalarý hakkýnda uyarmaz

source: Turn off --whole-archive
tr: --whole-archive seçeneðini etkisizleþtirir

source: Create an output file even if errors occur
tr: Hatalar oluþsa bile bir çýktý dosyasý oluþturur

source: Specify target of output file
tr: Çýktý dosyasýnýn hedefini belirler

source: Ignored for Linux compatibility
tr: Linux uyumluluðu için yoksayýldý

source: Relax branches on certain targets
tr: Bazý hedeflerde dallarý gevþetir

source: Keep only symbols listed in FILE
tr: Yalnýzca DOSYA'da belirtilen sembolleri tutar

source: Set runtime shared library search path
tr: Çalýþma zamaný paylaþýmlý kitaplýk arama yolunu belirler

source: Set link time shared library search path
tr: Baðlama zamaný paylaþýmlý kitaplýk arama yolunu belirler

source: Create a shared library
tr: Paylaþýmlý kitaplýk oluþturur

source: Sort common symbols by size
tr: Ortak sembolleri boyuta göre sýralar

source: [=SIZE]
tr: [=BOYUT]

source: Split output sections every SIZE octets
tr: Her BOYUT sekizliðinde çýktý bölümlerini ayýrýr

source: [=COUNT]
tr: [=SAYI]

source: Split output sections every COUNT relocs
tr: Her SAYI yerdeðiþiminde çýktý bölümlerini ayýrýr

source: Print memory usage statistics
tr: Bellek kullaným istatistiklerini gösterir

source: Display target specific options
tr: Hedefe özel seçenekleri gösterir

source: Do task level linking
tr: Görev seviyesinde baðlama yapar

source: Use same format as native linker
tr: Yerel baðlayýcý ile ayný biçemi kullanýr

source: SECTION=ADDRESS
tr: BÖLÜM=ADRES

source: Set address of named section
tr: Ýsimli bölümün adresini belirler

source: Set address of .bss section
tr: .bss bölümünün adresini belirler

source: Set address of .data section
tr: .data bölümünün adresini belirler

source: Set address of .text section
tr: .text bölümünün adresini belirler

source: Output lots of information during link
tr: Baðlama esnasýnda ek bilgi gösterir

source: Read version information script
tr: Sürüm bilgisi betiðini okur

source: Take export symbols list from .exports, using SYMBOL as the version.
tr: Ýhraç sembolleri listesini .exports'dan alýr, sürüm olarak SEMBOL deðerini kullanýr.

source: Warn about duplicate common symbols
tr: Tekrarlanmýþ ortak semboller hakkýnda uyarý verir

source: Warn if global constructors/destructors are seen
tr: Evrensel kurucu/serbestleþtiriciler bulunursa uyarý verir

source: Warn if the multiple GP values are used
tr: Çoklu GP deðerleri kullanýlýrsa uyarý verir

source: Warn only once per undefined symbol
tr: Her tanýmsýz sembol için bir defa uyarý verir

source: Warn if start of section changes due to alignment
tr: Hizalama sebebi ile bölüm baþlangýcý deðiþirse uyarý verir

source: Include all objects from following archives
tr: Aþaðýdaki arþivlerdeki tüm nesneleri içerir

source: Use wrapper functions for SYMBOL
tr: SEMBOL için sarmalama iþlevleri kullanýr

source: [=WORDS]
tr: [=SÖZCÜKLER]

source: Modify problematic branches in last WORDS (1-10, default 5) words of a page
tr: Bir sayfanýn son SÖZCÜKLER sözcüklerindeki (1-10, öntanýmlý 5) problemli dallarý deðiþtirir

source: %s: use the --help option for usage information
tr: %s: kullaným bilgisi için --help seçeneðini kullanýn

source: %P%F: unrecognized -a option `%s'
tr: %P%F: bilinmeyen -a seçeneði `%s'

source: %P%F: unrecognized -assert option `%s'
tr: %P%F: bilinmeyen -assert seçeneði `%s'

source: %F%P: unknown demangling style `%s'
tr: %F%P: bilinmeyen düzeltme tarzý `%s'

source: %P%F: invalid number `%s'
tr: %P%F: geçersiz sayý `%s'

source: %P%F: -shared not supported
tr: %P%F: -shared desteklenmiyor

source: %s: Invalid argument to option "--section-start"
tr: %s: "--section-start" seçeneðine geçersiz argüman verilmiþ

source: %s: Missing argument(s) to option "--section-start"
tr: %s: "--section-start" seçeneðine eksik argüman(lar) verilmiþ

source: Copyright 2000 Free Software Foundation, Inc.
tr: Telif Hakký 2000 Free Software Foundation, Inc.

source: This program is free software; you may redistribute it under the terms of the GNU General Public License. This program has absolutely no warranty.
tr: Bu, bir serbest yazýlýmdýr; GNU Genel Kamu Lisansý koþullarý altýnda deðiþiklik yapabilir ve/veya yeniden daðýtabilirsiniz. Bu yazýlýmýn herhangi bir garantisi yoktur.

source: %s: may not nest groups (--help for usage)
tr: %s: gruplar yuvalanamaz (yardým için --help)

source: %s: group ended before it began (--help for usage)
tr: %s: grup baþlamadan bitti (yardým için --help)

source: %s: Invalid argument to option "mpc860c0"
tr: %s: "mpc860c0" seçeneðine geçersiz argüman

source: %P%F: invalid hex number `%s'
tr: %P%F: geçersiz onaltýlýk sayý `%s'

source: Usage: %s [options] file...
tr: Kullanýmý: %s [seçenekler] DOSYA...

source: Options:
tr: Seçenekler:

source: %s: supported targets:
tr: %s: desteklenen hedefler:

source: %s: supported emulations:
tr: %s: desteklenen öykünümler:

source: %s: emulation specific options:
tr: %s: öykünüme özel seçenekler:

source: Report bugs to %s
tr: Yazýlým hatalarýný %s adresine, çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine gönderin

source: %P%F: unknown format type %s
tr: %P%F: bilinmeyen biçem türü %s

source: %XUnsupported PEI architecture: %s
tr: %XDesteklenmeyen PEI platformu: %s

source: %XError, duplicate EXPORT with ordinals: %s (%d vs %d)
tr: %XHata, %s (%d yerine %d) onluklarý ile tekrarlanmýþ ÝHRAÇ

source: Warning, duplicate EXPORT: %s
tr: Uyarý, tekrarlanmýþ ÝHRAÇ: %s

source: %XCannot export %s: symbol not defined
tr: %X%s ihraç edilemedi: sembol tanýmsýz

source: %XCannot export %s: symbol wrong type (%d vs %d)
tr: %X%s ihraç edilemedi: sembol hatalý türde (%d yerine %d)

source: %XCannot export %s: symbol not found
tr: %X%s ihraç edilemedi: sembol bulunamadý

source: %XError, ordinal used twice: %d (%s vs %s)
tr: %XHata, %d (%s yerine %s) onluðu iki defa kullanýlmýþ

source: %XError: %d-bit reloc in dll
tr: %XHata: dll'de %d-bitlik yerdeðiþim

source: %s: Can't open output def file %s
tr: %s: %s taným dosyasý açýlamadý

source: ; no contents available
tr: ; içerik yok

source: %XCan't open .lib file: %s
tr: %X.lib dosyasý açýlamadý: %s

source: Creating library file: %s
tr: Kitaplýk dosyasý oluþturuluyor: %s
