Repository: MIPS/binutils-gdb
Catalog: ld/po/*.po
Languages: tr

source: --support-old-code Support interworking with old code
tr: --support-old-code Eski yazýlým ile beraber çalýþmayý destekler

source: --thumb-entry=<sym> Set the entry point to be Thumb symbol <sym>
tr: --thumb-entry=<sem> Giriþ noktasýný Thumb sembolü <sem> olarak atar

source: Errors encountered processing file %s
tr: %s dosyasý iþlenirken hata oluþtu

source: %P: warning: '--thumb-entry %s' is overriding '-e %s'
tr: %P: uyarý: '--thumb-entry %s', '-e %s' seçeneðini etkisizleþtiriyor

source: %P: warning: connot find thumb start symbol %s
tr: %P: uyarý: thumb baþlangýç sembolü %s bulunamadý

source: --base_file <basefile> Generate a base file for relocatable DLLs
tr: --base_file <temeldosya> Yerdeðiþtirebilen DLL'ler için temeldosya oluþturur.

source: --dll Set image base to the default for DLLs
tr: --dll DLL'ler için görüntü temelini öntanýmlýya ayarlar.

source: --file-alignment <size> Set file alignment
tr: --file-alignment <boyut> Dosya hizalamasýný ayarlar

source: --heap <size> Set initial size of the heap
tr: --heap <boy> Yýðýnýn ilk boyunu ayarlar.

source: --image-base <address> Set start address of the executable
tr: --image-base <adres> Uygulamanýn baþlangýç adresini ayarlar

source: --major-image-version <number> Set version number of the executable
tr: --major-image-version <numara> Uygulamanýn sürüm numarasýný ayarlar

source: --major-os-version <number> Set minimum required OS version
tr: --major-os-version <numara> OS için en alt gerekli sürümü belirler

source: --major-subsystem-version <number> Set minimum required OS subsystem version
tr: --major-subsystem-version <numara> OS alt sistem sürümü için en küçük gerekli sürüm sayýsýný belirler

source: --minor-image-version <number> Set revision number of the executable
tr: --minor-image-version <numara> Uygulamanýn deðiþim sayýsýný ayarlar

source: --minor-os-version <number> Set minimum required OS revision
tr: --minor-os-version <numara> Gerekli en alt OS deðiþimini belirler

source: --minor-subsystem-version <number> Set minimum required OS subsystem revision
tr: --minor-subsystem-version <numara> Gerekli en alt OS alt sistem deðiþim sayýsýný belirler

source: --section-alignment <size> Set section alignment
tr: --section-alignment <boy> Bölüm hizalamasýný ayarlar

source: --stack <size> Set size of the initial stack
tr: --stack <boy> Yýðýtýn ilk boyunu belirler

source: --subsystem <name>[:<version>] Set required OS subsystem [& version]
tr: --subsystem <isim>[:<sürüm>] Gerekli OS, altsistem ve sürümü belirler

source: --support-old-code Support interworking with old code
tr: --support-old-code Eski kod ile beraber çalýþmayý destekler

source: --thumb-entry=<symbol> Set the entry point to be Thumb <symbol>
tr: --thumb-entry=<sembol> Giriþ noktasýný Thumb <sembol> olarak atar

source: --add-stdcall-alias Export symbols with and without @nn
tr: --add-stdcall-alias Sembolleri @nn ile ve @nn'siz ihraç eder

source: --disable-stdcall-fixup Don't link _sym to _sym@nn
tr: --disable-stdcall-fixup _sym'i _sym@nn'e baðlamaz

source: --enable-stdcall-fixup Link _sym to _sym@nn without warnings
tr: --enable-stdcall-fixup _sym'i _sym@nn'e uyarý vermeksizin baðlar

source: --exclude-symbols sym,sym,... Exclude symbols from automatic export
tr: --exclude-symbols sem,sem,... Sembolleri otomatik ihraçtan ayrý tutar

source: --export-all-symbols Automatically export all globals to DLL
tr: --export-all-symbols Bütün evrenselleri DLL'e ihraç eder

source: --kill-at Remove @nn from exported symbols
tr: --kill-at Ýhraç edilen sembollerden @nn'i çýkarýr

source: --out-implib <file> Generate import library
tr: --out-implib <dosya> Ýthal kitaplýðý oluþturur

source: --output-def <file> Generate a .DEF file for the built DLL
tr: --output-def <dosya> Oluþturulmuþ DLL için .DEF dosyasý oluþturur

source: --warn-duplicate-exports Warn about duplicate exports.
tr: --warn-duplicate-exports Birden fazla ihraçlarda uyarý verir

source: --compat-implib Create backward compatible import libs;
tr: --compat-implib Geçmiþe uyumlu ithal kitaplýðý oluþturur.

source: create __imp_<SYMBOL> as well.
tr: __imp_<SEMBOL>'ünü de oluþturur.

source: --enable-auto-image-base Automatically choose image base for DLLs
tr: --enable-auto-image-base DLL'ler için otomatik görüntü temeli seçer

source: unless user specifies one
tr: eðer kullanýcý bir tane belirtmezse

source: --disable-auto-image-base Do not auto-choose image base. (default)
tr: --disable-auto-image-base Görüntü temelini otomatik olarak seçmez (öntanýmlý).

source: --dll-search-prefix=<string> When linking dynamically to a dll witout an
tr: --dll-search-prefix=<dizge> Bir dll'e ithal kitaplýðý olmaksýzýn

source: importlib, use <string><basename>.dll
tr: dinamik baðlanýlýrken, lib<temelad>.dll yerine

source: in preference to lib<basename>.dll
tr: <dizge><temelad>.dll kullanýr

source: %P: warning: bad version number in -subsystem option
tr: %P: uyarý: -subsystem seçeneðinde hatalý sürüm sayýsý

source: %P%F: invalid subsystem type %s
tr: %P%F: geçersiz altsistem türü %s

source: %P%F: invalid hex number for PE parameter '%s'
tr: %P%F: PE parametresi '%s' için geçersiz onaltýlýk sayý

source: %P%F: strange hex info for PE parameter '%s'
tr: %P%F: PE parametresi '%s' için garip onaltýlýk bilgi

source: %s: Can't open base file %s
tr: %s: %s temel dosyasý açýlamadý

source: %P: warning, file alignment > section alignment.
tr: %P: uyarý, dosya hizalamasý > bölüm hizalamasý.

source: Warning: resolving %s by linking to %s
tr: Uyarý: %s %s'yi baðlayarak çözümleniyor

source: Use --enable-stdcall-fixup to disable these warnings
tr: Bu uyarýlarý etkisizleþirmek için --enable-stdcall-fixup kullanýn

source: Use --disable-stdcall-fixup to disable these fixups
tr: Bu düzeltmeleri etkisizleþtirmek için --disable-stdcall-fixup kullanýn

source: %F%P: PE operations on non PE file.
tr: %F%P: PE dosyasý olmayan dosya üzerinde PE iþlemleri.

source: Errors encountered processing file %s
tr: %s dosyasý iþlenirken hata oluþtu

source: Errors encountered processing file %s for interworking
tr: %s dosyasý beraber çalýþma için iþlenirken hata oluþtu

source: %P%F: bfd_link_hash_lookup failed: %E
tr: %P%F: bfd_link_hash_lookup baþarýsýz: %E

source: %X%P: bfd_hash_table_init of cref table failed: %E
tr: %X%P: cref tablosunda bfd_hash_table_init baþarýsýz: %E

source: %X%P: cref_hash_lookup failed: %E
tr: %X%P: cref_hash_lookup baþarýsýz: %E

source: Cross Reference Table
tr: Çapraz Baþvuru Tablosu

source: Symbol
tr: Sembol

source: File
tr: Dosya

source: No symbols
tr: Sembol yok

source: %P: symbol `%T' missing from main hash table
tr: %P: `%T' sembolü ana hash tablosunda yok

source: %B%F: could not read symbols; %E
tr: %B%F: semboller okunamadý; %E

source: %B%F: could not read symbols: %E
tr: %B%F: semboller okunamadý: %E

source: %B%F: could not read relocs: %E
tr: %B%F: yer deðiþimleri okunamadý: %E

source: %X%C: prohibited cross reference from %s to `%T' in %s
tr: %1$X%2$C: %5$s içinde %3$s'den `%4$T'e yasak çapraz baþvuru

source: %P%X: Different relocs used in set %s
tr: %P%X: %s kümesinde farklý yerdeðiþimler kullanýlmýþ

source: %P%X: Different object file formats composing set %s
tr: %P%X: %s kümesi farklý nesne dosyasý biçemleri içeriyor

source: %P%X: %s does not support reloc %s for set %s
tr: %1$P%2$X: %3$s %5$s %4$s yerdeðiþimlerini desteklemiyor

source: %P%X: Unsupported size %d for set %s
tr: %1$P%2$X: %4$s kümesi için desteklenmeyen boy %3$d

source: Set Symbol
tr: Küme Sembol

source: %S SYSLIB ignored
tr: %S SYSLIB yoksayýldý

source: %S HLL ignored
tr: %S HLL yoksayýldý

source: %P: unrecognised emulation mode: %s
tr: %P: bilinmeyen öykünüm kipi: %s

source: Supported emulations:
tr: Desteklenen öykünümler:

source: no emulation specific options.
tr: öykünüme özel seçenek yok.

source: %F%P: %s uses undefined section %s
tr: %F%P: %s tanýmsýz %s bölümünü kullanýyor

source: %F%P: %s forward reference of section %s
tr: %F%P: %s %s bölümüne ileriye baþvuru

source: %F%S %% by zero
tr: %F%S %% sýfýrla

source: %F%S / by zero
tr: %F%S sýfýrla bölme

source: %X%S: unresolvable symbol `%s' referenced in expression
tr: %X%S: ifadede çözümlenemeyen `%s' sembolüne baþvuru var

source: %F%S: undefined symbol `%s' referenced in expression
tr: %F%S: ifadede tanýmlanmamýþ `%s' sembolüne baþvuru var

source: %F%S can not PROVIDE assignment to location counter
tr: %F%S yer sayacýna atama YAPILAMAZ

source: %F%S invalid assignment to location counter
tr: %F%S yer sayacýna hatalý atama

source: %F%S assignment to location counter invalid outside of SECTION
tr: %F%S yer sayacýna atama BÖLÜM'ün dýþýnda geçersiz

source: %F%S cannot move location counter backwards (from %V to %V)
tr: %F%S yer sayacý geri gidemez (%V'den %V'e)

source: %P%F:%s: hash creation failed
tr: %P%F:%s: hash oluþturulmasý baþarýsýz

source: %F%S nonconstant expression for %s
tr: %F%S %s için sabit olmayan ifade

source: %F%S non constant expression for %s
tr: %F%S %s için sabit olmayan ifade

source: attempt to open %s failed
tr: %s açýlamadý

source: attempt to open %s succeeded
tr: %s açýlabildi

source: %F%P: invalid BFD target `%s'
tr: %F%P: hatalý BFD hedefi `%s'

source: %P: skipping incompatible %s when searching for %s
tr: %1$P: %3$s için arama yapýlýrken uyumsuz %2$s atlandý

source: %F%P: cannot open %s for %s: %E
tr: %1$F%2$P: %4$s için %3$s açýlamadý: %5$E

source: %F%P: cannot open %s: %E
tr: %F%P: %s açýlamadý: %E

source: %F%P: cannot find %s
tr: %F%P: %s bulunamadý

source: cannot find script file %s
tr: %s betik dosyasý bulunamadý

source: opened script file %s
tr: %s betik dosyasý açýldý

source: %P%F: cannot open linker script file %s: %E
tr: %P%F: %s baðlayýcý betik dosyasý açýlamadý: %E

source: %P%F: unknown architecture: %s
tr: %P%F: bilinmeyen platform: %s

source: %P%F: target architecture respecified
tr: %P%F: hedef platform yeniden belirtilmiþ

source: %P%F: cannot represent machine `%s'
tr: %P%F: `%s' makinasý gösterilemiyor

source: Memory Configuration
tr: Bellek Ayarlarý

source: Name
tr: Ýsim

source: Origin
tr: Orijin

source: Length
tr: Uzunluk

source: Attributes
tr: Özellikler

source: Linker script and memory map
tr: Baðlayýcý betiði ve bellek eþlemesi

source: %P%F: Illegal use of `%s' section
tr: %P%F: `%s' bölümünün geçersiz kullanýmý

source: %P%F: output format %s cannot represent section called %s
tr: %P%F: %s çýktý biçemi %s adýndaki bölümü temsil edemez

source: %P: %B: warning: ignoring duplicate section `%s'
tr: %P: %B: uyarý: birden fazla tekrar edilmiþ `%s' bölümü yoksayýldý

source: %P: %B: warning: ignoring duplicate `%s' section symbol `%s'
tr: %P: %B: uyarý: birden fazla tekrar edilmiþ `%s' bölümü `%s' sembolü yoksayýldý

source: %P: %B: warning: duplicate section `%s' has different size
tr: %P: %B: uyarý: birden fazla tekrar edilmiþ `%s' bölümünün boyutu farklý

source: %P%F: Failed to create hash table
tr: %P%F: Hash tablosu oluþturulamadý

source: %B: file not recognized: %E
tr: %B: Bilinmeyen dosya: %E

source: %B: matching formats:
tr: %B: eþleþen biçemler:

source: %F%B: file not recognized: %E
tr: %F%B: bilinmeyen dosya: %E

source: %F%B: object %B in archive is not object
tr: %F%B: arþivdeki %B nesnesi nesne deðil

source: %F%B: could not read symbols: %E
tr: %F%B: semboller okunamadý: %E

source: %P: warning: could not find any targets that match endianness requirement
tr: %P: uyarý: küçük/büyük sonlu gerekliliðini karþýlayan hedef bulunamadý

source: %P%F: target %s not found
tr: %P%F: %s hedefi bulunamadý

source: %P%F: cannot open output file %s: %E
tr: %P%F: %s çýktý dosyasý açýlamadý: %E

source: %P%F:%s: can not make object file: %E
tr: %P%F:%s: nesne dosyasý oluþturulamadý: %E

source: %P%F:%s: can not set architecture: %E
tr: %P%F:%s: platform türü atanamadý: %E

source: %P%F: can not create link hash table: %E
tr: %P%F: bað hash tablosu oluþturulamadý: %E

source: load address 0x%V
tr: yükleme adresi 0x%V

source: %W (size before relaxing)
tr: %W (gevþetmeden önceki boyut)

source: Address of section %s set to
tr: %s bölümünün adresi atanmýþ

source: Fail with %d
tr: %d hatasý verildi

source: %X%P: section %s [%V -> %V] overlaps section %s [%V -> %V]
tr: %X%P: %s bölümü [%V -> %V] %s bölümü [%V -> %V] ile örtüþüyor

source: %X%P: address 0x%v of %B section %s is not within region %s
tr: %1$X%2$P: %5$s %4$B bölümünde 0x%3$v adresi %6$s kapsamý içinde deðil

source: %X%P: region %s is full (%B section %s)
tr: %X%P: %s bölümü dolu (%B %s bölümü)

source: %P%X: Internal error on COFF shared library section %s
tr: %P%X: %s COFF paylaþýmlý kitaplýk bölümünde iç hata

source: %P: warning: no memory region specified for section `%s'
tr: %P: uyarý: `%s' bölümü için bellek bölümü belirtilmemiþ

source: %P: warning: changing start of section %s by %u bytes
tr: %P: uyarý: %s bölümünün baþlangýcý %u bayt deðiþtirildi

source: %F%S: non constant address expression for section %s
tr: %F%S: %s bölümü için sabit olmayan adres açýlýmý

source: %X%P: use an absolute load address or a load memory region, not both
tr: %X%P: kesin bir yükleme adresi ve bellek bölümü yüklemek ayný anda kullanýlamaz

source: %P%F: can't relax section: %E
tr: %P%F: bölüm gevþetilemedi: %E

source: %F%P: invalid data statement
tr: %F%P: geçersiz veri deyimi

source: %F%P: invalid reloc statement
tr: %F%P: geçersiz yerdeðiþim deyimi

source: %P%F:%s: can't set start address
tr: %P%F:%s: baþlangýç adresi atanamadý

source: %P%F: can't set start address
tr: %P%F: baþlangýç adresi atanamadý

source: %P: warning: cannot find entry symbol %s; defaulting to %V
tr: %P: uyarý: giriþ sembolü %s bulunamadý; öntanýmlý %V kullanýlýyor

source: %P: warning: cannot find entry symbol %s; not setting start address
tr: %P: uyarý: giriþ sembolü %s bulunamadý; baþlangýç adresi atanmýyor

source: %P: warning: %s architecture of input file `%B' is incompatible with %s output
tr: %1$P: uyarý: `%3$B' girdi dosyasýnýn platformu %2$s, %4$s çýktýsýyla uyumlu deðil

source: %E%X: failed to merge target specific data of file %B
tr: %E%X: %B dosyasýndaki hedefe özel veri birleþtirilemedi

source: Allocating common symbols
tr: Ortak sembollere bellek ayrýlýyor

source: Common symbol size file
tr: Ortak sembol boy dosya

source: %P: no [COMMON] command, defaulting to .bss
tr: %P: [ORTAK] komutu yok, öntanýmlý .bss kullanýlýyor

source: %P%F: invalid syntax in flags
tr: %P%F: bayraklarda geçersiz sözdizimi

source: %P%Fmultiple STARTUP files
tr: %P%Fbirden fazla BAÞLANGIÇ dosyasý

source: %F%P: bfd_record_phdr failed: %E
tr: %F%P: bfd_record_phdr baþarýsýz: %E

source: %X%P: section `%s' assigned to non-existent phdr `%s'
tr: %X%P: `%s' bölümü var olmayan phdr `%s'a atanmýþ

source: %X%P: unknown language `%s' in version information
tr: %X%P: sürüm bilgisinde bilinmeyen `%s' dili

source: %X%P: duplicate version tag `%s'
tr: %X%P: birden fazla sürüm etiketi `%s'

source: %X%P: duplicate expression `%s' in version information
tr: %X%P: sürüm bilgisinde birden fazla `%s' ifadesi

source: %X%P: unable to find version dependency `%s'
tr: %X%P: sürüm baðýmlýlýðý `%s' karþýlanamadý

source: %X%P: unable to read .exports section contents
tr: %X%P: .exports bölümünün içeriði okunamadý

source: %X%P: can't set BFD default target to `%s': %E
tr: %X%P: BFD öntanýmlý hedefi `%s' olarak atanamadý: %E

source: %P%F: -r and --mpc860c0 may not be used together
tr: %P%F: -r ve --mpc860c0 beraber kullanýlamaz

source: %P%F: --relax and -r may not be used together
tr: %P%F: --relax ve -r beraber kullanýlamaz

source: %P%F: -r and -shared may not be used together
tr: %P%F: -r ve -shared beraber kullanýlamaz

source: using internal linker script:
tr: iç baðlayýcý betiði kullanýlýyor:

source: %P%F: no input files
tr: %P%F: girdi dosyasý yok

source: %P: mode %s
tr: %P: %s kipi

source: %P%F: cannot open map file %s: %E
tr: %P%F: Eþleme dosyasý %s açýlamadý: %E

source: %P: link errors found, deleting executable `%s'
tr: %P: baðlama hatalarý bulundu, `%s' uygulamasý siliniyor

source: %F%B: final close failed: %E
tr: %F%B: son kapatma baþarýsýz: %E

source: %X%P: unable to open for source of copy `%s'
tr: %X%P: `%s' kopyasýnýn kaynaðý açýlamadý

source: %X%P: unable to open for destination of copy `%s'
tr: %X%P: `%s' kopyasý için hedef açýlamadý

source: %P: Error writing file `%s'
tr: %P: `%s' dosyasý yazýlýrken hata oluþtu

source: %P: Error closing file `%s'
tr: %P: `%s' dosyasý kapatýlýrken hata oluþtu

source: %s: total time in link: %ld.%06ld
tr: %s: Baðlanmada geçen toplam süre: %ld.%06ld

source: %s: data size %ld
tr: %s: veri boyu %ld

source: %P%F: missing argument to -m
tr: %P%F: -m için argüman eksik

source: %P%F: bfd_hash_table_init failed: %E
tr: %P%F: bfd_hash_table_init baþarýsýz: %E

source: %P%F: bfd_hash_lookup failed: %E
tr: %P%F: bfd_hash_lookup baþarýsýz: %E

source: %X%P: error: duplicate retain-symbols-file
tr: %X%P: hata: duplicate retain-symbols-file

source: %P%F: bfd_hash_lookup for insertion failed: %E
tr: %P%F: yerleþtirme için bfd_hash_lookup baþarýsýz: %E

source: %P: `-retain-symbols-file' overrides `-s' and `-S'
tr: %P: `-retain-symbols-file' seçeneði `-s' and `-S' seçeneklerinin yerine geçer

source: Archive member included
tr: Arþiv öðesi içerildi

source: because of file (symbol)
tr: dosya yüzünden (sembol)

source: %X%C: multiple definition of `%T'
tr: %X%C: `%T' için birden fazla taným

source: %D: first defined here
tr: %D: ilk burada tanýmlanmýþ

source: %P: Disabling relaxation: it will not work with multiple definitions
tr: %P: Gevþetme etkisizleþtirildi: çoklu tanýmlarla beraber çalýþmaz

source: %B: warning: definition of `%T' overriding common
tr: %B: uyarý: `%T' tanýmý genelin yerine geçiyor

source: %B: warning: common is here
tr: %B: uyarý: genel burada

source: %B: warning: common of `%T' overridden by definition
tr: %B: uyarý: taným, `%T'nin genelinin yerine geçti

source: %B: warning: defined here
tr: %B: uyarý: burada tanýmlanmýþ

source: %B: warning: common of `%T' overridden by larger common
tr: %B: uyarý: Daha büyük genel, `%T'nin genelinin yerine geçti

source: %B: warning: larger common is here
tr: %B: uyarý: daha büyük genel burada

source: %B: warning: common of `%T' overriding smaller common
tr: %B: uyarý: `%T'nin geneli daha küçük genelin yerine geçti

source: %B: warning: smaller common is here
tr: %B: uyarý: daha küçük genel burada

source: %B: warning: multiple common of `%T'
tr: %B: uyarý: `%T'nin birden fazla geneli var

source: %B: warning: previous common is here
tr: %B: uyarý: bir önceki genel burada

source: %P: warning: global constructor %s used
tr: %P: uyarý: evrensel kurucu %s kullanýldý

source: %P%F: BFD backend error: BFD_RELOC_CTOR unsupported
tr: %P%F: BFD arkayüz hatasý: BFD_RELOC_CTOR desteklenmiyor

source: %F%P: bfd_hash_table_init failed: %E
tr: %F%P: bfd_hash_table_init baþarýsýz: %E

source: %F%P: bfd_hash_lookup failed: %E
tr: %F%P: bfd_hash_lookup baþarýsýz: %E

source: %C: undefined reference to `%T'
tr: %C: `%T'ye tanýmsýz baþvuru

source: %D: more undefined references to `%T' follow
tr: %D: `%T'ye baþka tanýmsýz baþvurular aþaðýda

source: %B: undefined reference to `%T'
tr: %B: `%T'ye tanýmsýz baþvuru

source: %B: more undefined references to `%T' follow
tr: %B: `%T'ye baþka tanýmsýz baþvurular aþaðýda

source: %P%X: generated
tr: %P%X: oluþturuldu

source: relocation truncated to fit: %s %T
tr: yer deðiþim sýðmasý için budandý: %s %T

source: dangerous relocation: %s
tr: tehlikeli yerdeðiþim: %s

source: reloc refers to symbol `%T' which is not being output
tr: yer deðiþim, çýktýlanmayan `%T' sembolüne referans veriyor

source: no symbol
tr: sembol yok

source: built in linker script:%u
tr: yerleþik baðlayýcý betiði:%u

source: %B%F: could not read symbols
tr: %B%F: semboller okunamadý

source: %B: In function `%T':
tr: %B: `%T' Ýþlevinde:

source: %F%P: internal error %s %d
tr: %F%P: iç hata %s %d

source: %P: internal error: aborting at %s line %d in %s
tr: %1$P: iç hata: %4$s içinde %3$d satýrý %2$s'da durduruldu

source: %P: internal error: aborting at %s line %d
tr: %P: iç hata: %s'da, %d satýrýnda durduruldu

source: %P%F: please report this bug
tr: %P%F: lütfen bu yazýlým hatasýný bildirin

source: GNU ld version %s (with BFD %s)
tr: GNU ld sürüm %s (BFD %s ile)

source: Supported emulations:
tr: Desteklenen öykünümler:

source: %P%F: bfd_new_link_order failed
tr: %P%F: bfd_new_link_order baþarýsýz

source: %F%P: clone section failed: %E
tr: %F%P: bölümü çoðaltmak baþarýsýz : %E

source: %8x something else
tr: %8x baþka bir þey

source: %F%P: final link failed: %E
tr: %F%P: son baðlama baþarýsýz: %E

source: KEYWORD
tr: ANAHTARSÖZ

source: Shared library control for HP/UX compatibility
tr: HP/UX uyumluluðu için paylaþýmlý kitaplýk kontrolü

source: ARCH
tr: PLATFORM

source: Set architecture
tr: Platformu belirler

source: TARGET
tr: HEDEF

source: Specify target for following input files
tr: Aþaðýdaki girdi dosyalarý için hedef belirler

source: FILE
tr: DOSYA

source: Read MRI format linker script
tr: MRI biçeminde baðlayýcý betiði okur

source: Force common symbols to be defined
tr: genel sembollerin tanýmlý olmasýný þart koþar

source: ADDRESS
tr: ADRES

source: Set start address
tr: Baþlangýç adresini atar

source: Export all dynamic symbols
tr: Bütün dinamik sembolleri ihraç eder

source: Link big-endian objects
tr: Büyük sonlu nesneleri baðlar

source: Link little-endian objects
tr: Küçük-sonlu nesneleri baðlar

source: Auxiliary filter for shared object symbol table
tr: Paylaþýmlý nesne sembol tablosu için ikincil filtre

source: Filter for shared object symbol table
tr: Paylaþýmlý nesne sembol tablosu için filtre

source: Ignored
tr: Gözardý edilmiþ

source: SIZE
tr: BOYUT

source: Small data size (if no size, same as --shared)
tr: Küçük veri boyu (eðer boy belirtilmemiþse, --shared ile ayný)

source: FILENAME
tr: DOSYAÝSMÝ

source: Set internal name of shared library
tr: Paylaþýmlý kitaplýðýn iç adýný belirler

source: LIBNAME
tr: KÝTAPLIKADI

source: Search for library LIBNAME
tr: KÝTAPLIKADI kitaplýðýný arar

source: DIRECTORY
tr: DÝZÝN

source: Add DIRECTORY to library search path
tr: DÝZÝN'i kitaplýk arama yoluna ekler

source: EMULATION
tr: ÖYKÜNÜM

source: Set emulation
tr: Öykünümü belirler

source: Print map file on standard output
tr: Eþleme dosyasýný standart çýktýya yazdýrýr

source: Do not page align data
tr: Veriyi sayfaya hizalamaz

source: Do not page align data, do not make text readonly
tr: Veriyi sayfaya hizalamaz, metni saltokunur yapmaz

source: Set output file name
tr: Çýktý dosyasý adýný belirler

source: Optimize output file
tr: Çýktý dosyasýný eniyiler

source: Ignored for SVR4 compatibility
tr: SVR4 uyumluluðu için yoksayýldý

source: Generate relocateable output
tr: Yerdeðiþimli çýktý oluþturur

source: Just link symbols (if directory, same as --rpath)
tr: Yalnýz sembolleri baðlar (eðer dizin ise, --rpath ile ayný)

source: Strip all symbols
tr: Bütün sembolleri soyar

source: Strip debugging symbols
tr: Hata ayýklama sembollerini soyar

source: Trace file opens
tr: Ýzleme dosyasý açýlýr

source: Read linker script
tr: Baðlama betiði okunur

source: SYMBOL
tr: SEMBOL

source: Start with undefined reference to SYMBOL
tr: SEMBOL'e tanýmsýz baþvuru ile baþlýyor

source: Don't merge orphan sections with the same name
tr: Ayný adlý öksüz bölümleri birleþtirmez

source: Build global constructor/destructor tables
tr: Evrensel kurucu/serbestleþtirici tablolarý hazýrlar

source: Print version information
tr: Sürüm bilgisini gösterir

source: Print version and emulation information
tr: Sürüm ve öykünüm bilgisini gösterir

source: Discard all local symbols
tr: Bütün yerel sembolleri siler

source: Discard temporary local symbols
tr: Geçici yerel sembolleri siler

source: Trace mentions of SYMBOL
tr: SEMBOL'ün geçtiði yerleri takip eder

source: PATH
tr: YOL
